app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 3], ["created_at", "2015-05-04 21:20:32.076337"], ["updated_at", "2015-05-04 21:20:32.076337"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-05-04 21:20:35.811345"], ["id", 12]]

  def destroy
    @line_item.destroy
    @cart = Cart.find(session[:cart_id])
---
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 13]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 10]]