app/controllers/orders_controller.rb

INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "fgdf"], ["address", "fgfg"], ["email", "fgfg"], ["pay_type", "Check"], ["created_at", "2015-05-20 11:50:45.141743"], ["updated_at", "2015-05-20 11:50:45.141743"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 2]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        OrderNotifier.received(@order).deliver_now
        format.html { redirect_to store_url, notice: 'Thank you for your order.' }
        format.json { render action :show, status: :created, location: @order }
      else
        @cart = Cart.find(session[:cart_id])