app/controllers/sessions_controller.rb

SELECT COUNT(*) FROM "users"
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "nik"], ["password_digest", "$2a$10$IwKIRFvMKobADWyH8iMBuORkVJj3vzJXTk8UzaDQNvFFcf1CjJRD6"], ["created_at", "2015-06-22 19:09:30.199782"], ["updated_at", "2015-06-22 19:09:30.199782"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "nik"]]
---
  def create
    if User.count == 0
      user = User.create(name: params[:name], password: params[:password])
      session[:user_id] = user.id
      redirect_to admin_url
    else
    	user = User.find_by(name: params[:name])