app/controllers/users_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$97XJLlW1no3QJGSvnRTAKuKsHZFsKAnRvFm6KX9MVWHSq.6wDuFkq"], ["updated_at", "2015-06-22 21:23:45.706919"], ["id", 1]]
---
  def update
    @old_pass = params[:user].delete(:old_pass)
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    begin
      @user.destroy