app/views/line_items/destroy.js.erb

// $('#current_item').css({'background-color':'#114411'}).animate({'background-color':'#88ff88'},1000);
if ($('#cart tr.item').length == 0) {
---
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", 55]]